{
  "architectures": [
    "MobileBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "B-AGE",
    "1": "B-BUILDINGNUM",
    "2": "B-CITY",
    "3": "B-CREDITCARDNUMBER",
    "4": "B-DATE",
    "5": "B-DRIVERLICENSENUM",
    "6": "B-EMAIL",
    "7": "B-GENDER",
    "8": "B-GIVENNAME",
    "9": "B-IDCARDNUM",
    "10": "B-PASSPORTNUM",
    "11": "B-SEX",
    "12": "B-SOCIALNUM",
    "13": "B-STREET",
    "14": "B-SURNAME",
    "15": "B-TAXNUM",
    "16": "B-TELEPHONENUM",
    "17": "B-TIME",
    "18": "B-TITLE",
    "19": "B-ZIPCODE",
    "20": "I-BUILDINGNUM",
    "21": "I-CITY",
    "22": "I-CREDITCARDNUMBER",
    "23": "I-DATE",
    "24": "I-DRIVERLICENSENUM",
    "25": "I-EMAIL",
    "26": "I-GENDER",
    "27": "I-GIVENNAME",
    "28": "I-IDCARDNUM",
    "29": "I-PASSPORTNUM",
    "30": "I-SEX",
    "31": "I-SOCIALNUM",
    "32": "I-STREET",
    "33": "I-SURNAME",
    "34": "I-TAXNUM",
    "35": "I-TELEPHONENUM",
    "36": "I-TIME",
    "37": "I-TITLE",
    "38": "I-ZIPCODE",
    "39": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "B-AGE": 0,
    "B-BUILDINGNUM": 1,
    "B-CITY": 2,
    "B-CREDITCARDNUMBER": 3,
    "B-DATE": 4,
    "B-DRIVERLICENSENUM": 5,
    "B-EMAIL": 6,
    "B-GENDER": 7,
    "B-GIVENNAME": 8,
    "B-IDCARDNUM": 9,
    "B-PASSPORTNUM": 10,
    "B-SEX": 11,
    "B-SOCIALNUM": 12,
    "B-STREET": 13,
    "B-SURNAME": 14,
    "B-TAXNUM": 15,
    "B-TELEPHONENUM": 16,
    "B-TIME": 17,
    "B-TITLE": 18,
    "B-ZIPCODE": 19,
    "I-BUILDINGNUM": 20,
    "I-CITY": 21,
    "I-CREDITCARDNUMBER": 22,
    "I-DATE": 23,
    "I-DRIVERLICENSENUM": 24,
    "I-EMAIL": 25,
    "I-GENDER": 26,
    "I-GIVENNAME": 27,
    "I-IDCARDNUM": 28,
    "I-PASSPORTNUM": 29,
    "I-SEX": 30,
    "I-SOCIALNUM": 31,
    "I-STREET": 32,
    "I-SURNAME": 33,
    "I-TAXNUM": 34,
    "I-TELEPHONENUM": 35,
    "I-TIME": 36,
    "I-TITLE": 37,
    "I-ZIPCODE": 38,
    "O": 39
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "transformers_version": "4.56.1",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "vocab_size": 30522
}
